app/views/comments/_comment.html.haml

  %strong Commenter:
  ="#{User.find(comment.user_id).email}"
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]