app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'alcohol' LIMIT 1
INSERT INTO "events" ("action_type", "created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "pictures".* FROM "pictures" WHERE "pictures"."category_id" = 2
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."category_id" = 2
---
  def show
    @category = Category.find_by_name(params[:id])
    Event.create(:user_id=>current_user.id, :action_type=>"navigation", :data => {:url=>request.original_url,:category_name=>@category.name,:description=>'Watched category'})
    @pictures=Picture.where(category_id: @category.id).preload(:category)
    @pictures = Kaminari.paginate_array(@pictures).page(params[:page]).per(5)