app/controllers/comments_controller.rb

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "162"]]
INSERT INTO "comments" ("body", "created_at", "picture_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "rtrtr"], ["created_at", Sat, 22 Feb 2014 14:43:16 UTC +00:00], ["picture_id", 162], ["updated_at", Sat, 22 Feb 2014 14:43:16 UTC +00:00], ["user_id", 1]]
INSERT INTO "events" ("action_type", "created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 ORDER BY "categories"."id" ASC LIMIT 1  [["id", 3]]
---
def create
  @picture = Picture.find(params[:picture_id])
  @comment = Comment.create(comment_params.merge(:user => current_user, :picture => @picture))
  Event.create(:user_id=>current_user.id, :action_type=>"comments", :data => {:url=>request.original_url,:category_name=>Category.find(@picture.category_id).name,:picture_name=>@picture.image_file_name,:description=>'Commented picture'})