app/controllers/events_controller.rb

  def index
    @user=User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1

  def comments
    @event=Event.where(:action_type=> "comments")
---
SELECT "events".* FROM "events" WHERE "events"."action_type" = 'comments' LIMIT 1