app/controllers/likes_controller.rb

  def create
    @picture = Picture.find(params[:picture_id])

    @like = @picture.likes.where(user: current_user, picture_id: params[:picture_id]).first_or_create

    @like.update_attribute(:like, !@like.like)

    Event.create(:user_id=>current_user.id, :action_type=>"likes", :data => {:url=>request.original_url,:category_name=>Category.find(@picture.category_id).name,:picture_name=>@picture.image_file_name,:description=>'Liked picture'})
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "162"]]
INSERT INTO "likes" ("created_at", "picture_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 22 Feb 2014 14:43:11 UTC +00:00], ["picture_id", 162], ["updated_at", Sat, 22 Feb 2014 14:43:11 UTC +00:00], ["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."picture_id" = $1 AND "likes"."user_id" = 1 AND "likes"."picture_id" = 162 ORDER BY "likes"."id" ASC LIMIT 1  [["picture_id", 162]]
UPDATE "likes" SET "like" = $1, "updated_at" = $2 WHERE "likes"."id" = 5  [["like", true], ["updated_at", Sat, 22 Feb 2014 14:43:11 UTC +00:00]]
INSERT INTO "events" ("action_type", "created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 ORDER BY "categories"."id" ASC LIMIT 1  [["id", 3]]