app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"
---
  def index
    @picture = Picture.all.preload(:category)

SELECT "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", "1"]]
INSERT INTO "events" ("action_type", "created_at", "data", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "pictures" ("category_id", "created_at", "image_content_type", "image_file_name", "image_file_size", "image_updated_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 ORDER BY "categories"."id" ASC LIMIT 1  [["id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = $1  [["picture_id", 162]]
---
  def show
    @picture = Picture.find(params[:id])
    @comments=@picture.comments.preload(:user)
    Event.create(:user_id=>current_user.id, :action_type=>"navigation", :data => {:url=>request.original_url,:category_name=>Category.find(@picture.category_id).name,:picture_name=>@picture.image_file_name, :description=>'Watched picture'})