app/views/categories/show.html.haml

SELECT "pictures".* FROM "pictures" WHERE "pictures"."category_id" = 2
---

-@pictures=Picture.where(category_id: @category.id)